d3mocide/Oscilla/firmware-c5/sdkconfig.defaults
# oscilla-c5 defaults. Radio features are enabled as their phases land.

CONFIG_IDF_TARGET="esp32c5"

# The control UART is also the ROM console (Rev D §3), so boot noise on the
# link is unavoidable. Left enabled: the protocol tolerates it (OCP-SPEC §1.1).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Single-core: dispatch must outrank engines so `stop` lands (DESIGN §6.4).
CONFIG_FREERTOS_HZ=1000

# Fault, never hang (Rev D §4.3).
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
